## Problem 1

blood_info contains the data of blood types &
blood_fac contains the factor of each blood type.

But there is a little inconsistency. Some blood types are in blood_info which aren't in blood_fac.
Now we are going to remove these rows which contains inconsistency as well as not present in blood_fac.

In [38]:
import pandas as pd
import numpy as np

In [3]:
blood_info = pd.read_csv('C:/Users/Mehedi Hassan Galib/Desktop/Python/datas/blood_info.csv')
blood_fac = pd.read_csv('C:/Users/Mehedi Hassan Galib/Desktop/Python/datas/blood_fac.csv')

In [13]:
blood_info.head(3)

  Name Blood
0  ABC    A+
1  BCD    A-
2  DEF   AB+

In [14]:
blood_fac.head(3)

  Blood  Fcator
0    A+       1
1    A-       2
2   AB+       3

<br/>

## Find out the the inconsistency

In [4]:
incos = set(blood_info['Blood']).difference(blood_fac['Blood'])
incos

{'L-', 'Z+'}

<br/>

## Rows with inconsistency

In [8]:
blood_info[incos_rows]

  Name Blood
7  BCD    Z+
8  DEF    L-

<br/>

## Removing the rows with inconsistency

In [10]:
cos_data = blood_info[~incos_rows]

In [11]:
cos_data

  Name Blood
0  ABC    A+
1  BCD    A-
2  DEF   AB+
3  ABC    B+
4  BCD    B+
5  DEF    B-
6  ABC    O+

<br/>
<br/>
<br/>

## Problem 2

As python is case sensitive, it separates 'Married' and 'married' individually. Now we have to take care of this.

In [17]:
df = pd.read_csv('C:/Users/Mehedi Hassan Galib/Desktop/Python/datas/marital status.csv')

In [20]:
df['marital_status'].value_counts()

Married      3
Unmarried    2
unmarried    1
married      1
Name: marital_status, dtype: int64

In [21]:
df['marital_status'] = df['marital_status'].str.lower()

In [22]:
df['marital_status'].value_counts()

married      4
unmarried    3
Name: marital_status, dtype: int64

<br/>
<br/>
<br/>

## Problem 3

Inconsistency in phone number and raplacing them with NaN.

In [29]:
df1 = pd.read_csv('C:/Users/Mehedi Hassan Galib/Desktop/Python/datas/phone.csv')
df1

   Name            Phone
0     a  001-702-398-871
1     b  001-702-398-872
2     c  001-702-398-873
3     d  001-702-398-874
4     e  001-702-398-875
5     f   +1-702-398-876
6     g  001-702-398-877
7     h             9878
8     i  001-702-398-879
9     j  001-702-398-880
10    k  001-702-398-881

In [30]:
df1['Phone'] = df1['Phone'].str.replace('+', '00')

In [31]:
df1

   Name            Phone
0     a  001-702-398-871
1     b  001-702-398-872
2     c  001-702-398-873
3     d  001-702-398-874
4     e  001-702-398-875
5     f  001-702-398-876
6     g  001-702-398-877
7     h             9878
8     i  001-702-398-879
9     j  001-702-398-880
10    k  001-702-398-881

In [32]:
df1['Phone'] = df1['Phone'].str.replace('-', '')

In [33]:
df1

   Name         Phone
0     a  001702398871
1     b  001702398872
2     c  001702398873
3     d  001702398874
4     e  001702398875
5     f  001702398876
6     g  001702398877
7     h          9878
8     i  001702398879
9     j  001702398880
10    k  001702398881

In [35]:
digit = df1['Phone'].str.len()

In [36]:
digit

0     12
1     12
2     12
3     12
4     12
5     12
6     12
7      4
8     12
9     12
10    12
Name: Phone, dtype: int64

In [39]:
df1.loc[digit<12, 'Phone'] = np.nan

In [40]:
df1

   Name         Phone
0     a  001702398871
1     b  001702398872
2     c  001702398873
3     d  001702398874
4     e  001702398875
5     f  001702398876
6     g  001702398877
7     h           NaN
8     i  001702398879
9     j  001702398880
10    k  001702398881